{"how_to": 3, "sdks": 12, "followers": 1988, "developers": 706, "api_name": "", "description": " The Data API allows users to integrate their program with YouTube and allow it to perform many of the operations available on the website. It provides the capability to search for videos, retrieve standard feeds, and see related content. A program can also authenticate as a user to upload videos, modify user playlists, and more.\nThis integration can be used for a variety of uses such as developing a web application allowing users to upload video to YouTube, or a device or desktop application that brings the YouTube experience to a new platform. The Data API gives users programmatic access to the video and user information stored on YouTube. This can be used to personalize a web site or application with the user's existing information as well as perform actions like commenting on and rating videos. This RESTful API provides responses in XML format.", "changelogs": 170, "libraries": 17, "articles": 68, "sample_source_code": 109}
{"how_to": 7, "sdks": 15, "followers": 3585, "developers": 2574, "api_name": "", "description": " [This API is no longer available. Google Maps' services have been split into multiple APIs, including the Static Maps API, Street View Image API, Directions APIs, Distance Matrix API, Elevation API, Geocoding API, Geolocation API, Places API, Roads API, and Time Zone API.This page is maintained purely for historical and research purposes.]The Google Maps API allow for the embedding of Google Maps onto web pages of outside developers, using a simple JavaScript interface or a Flash interface. It is designed to work on both mobile devices as well as traditional desktop browser applications. The API includes language localization for over 50 languages, region localization and geocoding, and has mechanisms for enterprise developers who want to utilize the Google Maps API within an intranet. The API HTTP services can be accessed over a secure (HTTPS) connection by Google Maps API Premier customers.", "changelogs": 175, "libraries": 23, "articles": 227, "sample_source_code": 28}
{"how_to": 0, "sdks": 6, "followers": 1455, "developers": 62, "api_name": "", "description": " LinkedIn is the world's largest business social networking hub. Launched in 2003, LinkedIn has millions of users and is implemented in over 200 countries. One purpose of the site is to allow registered users to maintain a list of contact details of people with whom they have some level of relationship, called Connections. Users can invite anyone (whether a site user or not) to become a connection.\nThe LinkedIn API is a RESTful platform that provides a simple, consistent representation of people, companies, jobs, and the interactions and relationships between them. Our query language lets you read data in XML and JSON at the granularity and aggregation that you choose. Use OAuth 1.0a to authorize users and begin making REST API calls using any programming language.The API’s access is restricted to authorized developers.", "changelogs": 48, "libraries": 18, "articles": 37, "sample_source_code": 1}
{"how_to": 11, "sdks": 73, "followers": 2288, "developers": 822, "api_name": "", "description": " [This API is no longer available. It has been split into multiple APIs, including the Twitter Ads API, Twitter Search Tweets API, and Twitter Direct Message API.This profile is maintained for historical, research, and reference purposes only.]The Twitter micro-blogging service includes two RESTful APIs. The Twitter REST API methods allow developers to access core Twitter data. This includes update timelines, status data, and user information. The Search API methods give developers methods to interact with Twitter Search and trends data. The API presently supports the following data formats: XML, JSON, and the RSS and Atom syndication formats, with some methods only accepting a subset of these formats.", "changelogs": 257, "libraries": 38, "articles": 277, "sample_source_code": 25}
{"how_to": 0, "sdks": 26, "followers": 337, "developers": 60, "api_name": "", "description": " The Yelp Fusion APIs are RESTful APIs and users can retrieve business review and rating, information for a particular geographic region or location.display review information for a particular business, determine accurate neighborhood name information for a particular location, track recent reviews for a particular business, display pictures of highly rated local businesses and of the top reviewers for that business, determine a particular business' review and rating information based on the phone number for that business. The default output is JSON. This output format was chosen due to the availability of JSON parsers in many languages. The following Yelp Fusion APIs are available: Search, Phone Number Search, Business Search, Transaction, Reviews, and Autcomplete - each API has a separate ProgrammableWeb entry.", "changelogs": 50, "libraries": 1, "articles": 17, "sample_source_code": 7}
{"how_to": 0, "sdks": 9, "followers": 176, "developers": 85, "api_name": "", "description": " The Google AdSense API is ideal for developers whose users create their own content through blogging, web publishing, forum/wiki/community creation, or any other application where substantial web content is generated.\nUsing the AdSense API, developers can let users sign up for AdSense through their site or program, generate detailed performance reports for users, and choose how the AdSense revenue is shared with our revenue sharing program. Additionally users can create accounts to store publisher website information, then generate ad code snippets and filter out unwanted ads.\nA previous SOAP version has been deprecated in favor of REST with responses formatted as JSON.", "changelogs": 29, "libraries": 6, "articles": 7, "sample_source_code": 0}
{"how_to": 1, "sdks": 0, "followers": 255, "developers": 174, "api_name": "", "description": " Twilio provides a simple hosted API and markup language for businesses to quickly build scalable, reliable and advanced voice and SMS communications applications. Twilio provides a telephony infrastructure web service \"in the cloud\", enabling web programmers to integrate real-time phone calls into their applications. Twilio's simple Pay-As-You-Go pricing model means customers pay for capacity only when they need it, not before. Voice applications written on Twilio's cloud solution scale transparently, eliminating programming, operational and contractual headaches frequently associated with rapid growth or traffic spikes.\nThe SMS API allows users to send and receive SMS messages from their applications. The API can implement short code technology to allow both faster and higher volume sms messaging. Example uses of the API include sending customers automatic SMS messages, multi-factor authentication and interactive polling. The API uses a RESTful interface.", "changelogs": 9, "libraries": 0, "articles": 22, "sample_source_code": 3}
{"how_to": 0, "sdks": 8, "followers": 259, "developers": 124, "api_name": "", "description": " [This API is no longer available. Its functions have been split among the following APIs: Google App Engine Admin, Google App Engine Task Queue, Google Cloud App Engine Tasks, Google App Engine Admin RPC. This profile is being maintained purely for historical and research purposes.]\nUse the Google App Engine platform to run web apps on Google's infrastructure, the same scalable systems that run Google applications. Use the platform to run your apps reliably, even if you have heavy load and data needs. The environment has dynamic web serving, persistent storage with queries, sorting and transactions, automatic scaling and load balancing, APIs for authenticating users and sending email using Google Accounts, and a local testing environment.", "changelogs": 17, "libraries": 5, "articles": 52, "sample_source_code": 2}
{"how_to": 3, "sdks": 60, "followers": 794, "developers": 634, "api_name": "", "description": " The Flickr API can be used to retrieve photos from the Flickr photo sharing service using a variety of feeds - public photos and videos, favorites, friends, group pools, discussions, and more. The API can also be used to upload photos and video.The Flickr API supports many protocols including REST, SOAP, XML-RPC. Responses can be formatted in XML, XML-RPC, JSON and PHP. Documentation is included for 14 API Kit libraries.", "changelogs": 100, "libraries": 19, "articles": 52, "sample_source_code": 14}
{"how_to": 5, "sdks": 5, "followers": 644, "developers": 360, "api_name": "", "description": " Twilio provides a simple hosted API and markup language for businesses to quickly build scalable, reliable and advanced voice and SMS communications applications. Twilio provides a telephony infrastructure web service \"in the cloud\", enabling web programmers to integrate real-time phone calls into their applications. Twilio's simple Pay-As-You-Go pricing model means customers pay for capacity only when they need it, not before. Voice applications written on Twilio's cloud solution scale transparently, eliminating programming, operational and contractual headaches frequently associated with rapid growth or traffic spikes.\nTwilio provides a cloud API for voice and SMS communications that leverages existing web development skills, resources and infrastructure. It minimizes the learning curve required to build advanced, reliable voice communications applications that solve critical business needs. The syntax and programming model are focused on making application development as close to the request/response model of web application development as possible. The API uses a RESTful interface and responses are formatted in HTML, JSON, XML or CSV.", "changelogs": 69, "libraries": 34, "articles": 111, "sample_source_code": 10}
{"how_to": 0, "sdks": 0, "followers": 241, "developers": 160, "api_name": "", "description": " From their site: del.icio.us is a social bookmarking website -- the primary use of del.icio.us is to store your bookmarks online, which allows you to access the same bookmarks from any computer and add bookmarks from anywhere, too. On del.icio.us, you can use tags to organize and remember your bookmarks, which is a much more flexible system than folders.\nThe API provides read/write access to Delicious bookmarks and tags via an HTTP-based interface. The RESTful API returns responses in XML.", "changelogs": 0, "libraries": 0, "articles": 8, "sample_source_code": 3}
{"how_to": 0, "sdks": 2, "followers": 407, "developers": 174, "api_name": "", "description": " Bing Maps API and Interactive SDK features an AJAX Map Control. Use BM to build maps which can include routes and traffic info. Gives developers the ability to code the controls, shapes, and layers of the maps, and can summon the birds-eye, 3D, and aerial imagery. For commercial applications Bing Maps Web Services is a set of programmable SOAP services that allow users to integrate maps and imagery, driving directions, and other location features into a Web application.", "changelogs": 26, "libraries": 2, "articles": 8, "sample_source_code": 17}
{"how_to": 0, "sdks": 2, "followers": 123, "developers": 77, "api_name": "", "description": " The Amazon Elastic Compute Cloud (Amazon EC2) API is a web service that enables you to launch and manage Linux/UNIX and Windows server instances in Amazon's data centers. Giving users the ability to \"compute\" in the cloud, it provides users with complete control of their computing resources and lets them run on Amazon's computing environment. Amazon EC2 changes the economics of computing by allowing users to pay only for capacity that is actually used.\nThis is a REST-based API. The SOAP interface was deprecated on 1 December 2015.\nThe WSDL for each supported API version is available from the following URI:\nhttp://ec2.amazonaws.com/doc//AmazonEC2.wsdl", "changelogs": 17, "libraries": 6, "articles": 37, "sample_source_code": 5}
{"how_to": 0, "sdks": 11, "followers": 1193, "developers": 434, "api_name": "", "description": " What was formerly the ECS - eCommerce Service - has been renamed the Product Advertising API. Through this API developers can retrieve product information. The API exposes Amazon's product data and e-commerce functionality. This allows developers, web site publishers and others to leverage the Amazon Product Discovery features that Amazon uses to power its own business, and potentially make money as an Amazon affiliate. Additionally, the API has features allowing developers to advertise proucts, let users search for Amazon products and help users discover Amazon products. Both REST and SOAP APIs are provided, this profile is for the REST API.", "changelogs": 54, "libraries": 9, "articles": 14, "sample_source_code": 9}
{"how_to": 2, "sdks": 31, "followers": 4007, "developers": 446, "api_name": "", "description": " [This API is no longer available. Its functions have been split among the following APIs: Facebook Ads, Facebook Atlas, Facebook Graph, and Facebook Marketing. This profile is being maintained purely for historical and research purposes.]The Facebook API is a platform for building applications that are available to the members of the social network of Facebook. The API allows applications to use the social connections and profile information to make applications more involving, and to publish activities to the news feed and profile pages of Facebook, subject to individual users privacy settings. With the API, users can add social context to their applications by utilizing profile, friend, Page, group, photo, and event data. The API uses RESTful protocol and responses are in JSON format.", "changelogs": 144, "libraries": 25, "articles": 182, "sample_source_code": 8}
{"how_to": 0, "sdks": 3, "followers": 729, "developers": 83, "api_name": "", "description": " The unofficial Wikipedia API. Because Wikipedia is built using MediaWiki, which in turn supports an API, Wikipedia does as well. This provides developers code-level access to the entire Wikipedia reference. The goal of this API is to provide direct, high-level access to the data contained in the MediaWiki databases. Client programs can use the API to login, get data, and post changes. The API supports thin web-based JavaScript clients, such as Navigation popups or LiveRC, end-user applications (such as vandal fighter), and can be accessed by another web site (tool server's utilities).\nThe API uses RESTful calls and supports a wide variety of formats including XML, JSON, PHP, YAML and others.", "changelogs": 13, "libraries": 4, "articles": 3, "sample_source_code": 0}
{"how_to": 0, "sdks": 5, "followers": 582, "developers": 109, "api_name": "", "description": " The Foursquare Places API provides location based experiences with diverse information about venues, users, photos, and check-ins. The API supports real time access to places, Snap-to-Place that assigns users to specific locations, and Geo-tag. Additionally, Foursquare allows developers to build audience segments for analysis and measurement. JSON is the preferred response format.", "changelogs": 60, "libraries": 24, "articles": 73, "sample_source_code": 12}
{"how_to": 0, "sdks": 11, "followers": 681, "developers": 249, "api_name": "", "description": " The Last.fm API gives users the ability to build programs using Last.fm data, whether on the web, the desktop or mobile devices. The RESTful API allows for read and write access to the full slate of last.fm music data resources - albums, artists, playlists, events, users, and more. It allows users to call methods that respond in either XML or JSON.", "changelogs": 33, "libraries": 19, "articles": 20, "sample_source_code": 6}
{"how_to": 0, "sdks": 19, "followers": 483, "developers": 48, "api_name": "", "description": " Eventful is the world's largest collection of events, taking place in local markets throughout the world, from concerts and sports to singles events and political rallies. Eventful.com is built upon a unique, open platform that enables partners and web applications to leverage Eventful's data, features and functionality via the Eventful API. The Eventful API provides access to the entire site database enabling developers to integrate it and the functionality of the Eventful platform into web applications. Common API tasks include event and venue search. The API uses RESTful calls and responses are formatted in either XML, JSON or YAML.", "changelogs": 39, "libraries": 7, "articles": 4, "sample_source_code": 4}
{"how_to": 0, "sdks": 2, "followers": 283, "developers": 92, "api_name": "", "description": " Since 2006 Amazon Web Services has been offering web services commonly known as cloud computing. AWS Provides a reliable, low cost infrastructure platform that powers hundreds of thousands of businesses.\nAmazon S3 API, the Simple Storage Service provides a simple web services interface used to store objects using the Amazon online storage infrastructure. Users can then download the data or use the data with other AWS services, such as Amazon Elastic Cloud Computer (EC2). Using this web service, developers can build applications that make use of Internet storage.\nThe API uses Buckets, Objects, Keys and Operations. An object has four parts: value, key, metadata, and an access control policy. Objects are stored in buckets. The API is REST based. Responses are formatted in JSON.", "changelogs": 23, "libraries": 9, "articles": 31, "sample_source_code": 2}
{"how_to": 0, "sdks": 4, "followers": 251, "developers": 52, "api_name": "", "description": " The Google Earth Engine API allows developers to run algorithms on georeferenced imagery and vectors stored on Google's infrastructure. The Google Earth Engine API provides a library of functions which may be applied to imagery for display and analysis. Earth Engine's public data catalog contains a large amount of publicly available imagery.", "changelogs": 23, "libraries": 0, "articles": 10, "sample_source_code": 10}
{"how_to": 0, "sdks": 18, "followers": 229, "developers": 81, "api_name": "", "description": " Box is a modern content management platform that transforms how organizations work and collaborate to achieve results faster.Box Platform provides content APIs to build secure content experiences in custom apps. With Box Platform, organizations can bring content management and collaboration services to their own custom apps or build custom integrations with Box.", "changelogs": 52, "libraries": 6, "articles": 17, "sample_source_code": 8}
{"how_to": 1, "sdks": 0, "followers": 327, "developers": 67, "api_name": "", "description": " [The Bing API is now the Bing Web Search API. This profile is being maintained purely for historical and research purposes.]The Bing API provides an experience similar to Bing.com/search by returning search results that Bing determines are relevant to a user's query. The results include Web pages and may also include images, videos, and more. Free trial keys are available here: https://azure.microsoft.com/en-us/try/cognitive-services/?api=bing-web-search-api.", "changelogs": 18, "libraries": 3, "articles": 13, "sample_source_code": 10}
{"how_to": 0, "sdks": 20, "followers": 512, "developers": 91, "api_name": "", "description": " Geonames is a geographical database with web services that let users extract useful information about different places, such as weather, timezone and post codes. The GeoNames geographical database covers all countries and contains over eight million placenames that are available for download free of charge. Users can edit, correct and add new names using a wiki interface.Geonames provides a suite of Webservices including the following categories:Fulltext searchPlace HierarchyWikipediaPostal CodesReverse GeocodingThe APIs use RESTful protocol and responses vary in format between XML, JSON, CSV, and TXTWhile the GeoNames data is free, the data is available without costs, there is a Service Level Agreement available for premium web services.", "changelogs": 43, "libraries": 18, "articles": 8, "sample_source_code": 3}
{"how_to": 0, "sdks": 0, "followers": 274, "developers": 63, "api_name": "", "description": " [This API has been acquired by eBay and now exists as eBay Commerce Network. This profile is being maintained purely for historical and research purposes.]With the Shopping.com API you can integrate relevant product content with the deepest product catalog available online. Add millions of unique products and merchant offers to your site. Shopping.com, an eBay company, is the world's online comparison shopping service leader. Its global websites (Shopping.com, DealTime, and DoorOne) carry one of the world's largest product catalogs and offers from more than 6000 merchants.\nThe Shopping.com XML API uses a RESTful interface and can be used to feature dynamic Shopping.com content on your web pages. It offers capabilities such as keyword search, refining and sorting search results, finding product reviews, reading product specs, comparing products and prices from different merchants and controlling the number of results and navigating between pages.", "changelogs": 2, "libraries": 0, "articles": 3, "sample_source_code": 0}
{"how_to": 3, "sdks": 63, "followers": 458, "developers": 51, "api_name": "", "description": " The Graph API is a simple, consistent view of the Facebook social graph, that uniformly represents objects in the graph and may include people, photos, events, and pages etc., the connections between them, friend relationships, shared content, and more. Public information can be accessed without a developer key/application key, but is required for private data access. Facebook Developers enables you to build, grow and monetize amazing applications.", "changelogs": 121, "libraries": 2, "articles": 74, "sample_source_code": 0}
{"how_to": 0, "sdks": 9, "followers": 880, "developers": 33, "api_name": "", "description": " SoundCloud is the leading audio platform that enables anyone to upload, record, promote and share their sounds across the web. The SoundCloud API makes most of the features from SoundCloud.com available to app developers. With the help of its SDKs it's easy to integrate functionality like audio sharing and recording directly into iOS, Android and web apps.", "changelogs": 31, "libraries": 2, "articles": 13, "sample_source_code": 5}
{"how_to": 1, "sdks": 20, "followers": 1136, "developers": 57, "api_name": "", "description": " Instagram is a photo sharing iPhone app and service. Users take photos and can share them with Instagram contacts, as well as friends on other social networks like Twitter and Facebook. The Instagram API provides access to user authentication, friend connections, photos and all the other elements of the iPhone app--including uploading new media.", "changelogs": 84, "libraries": 12, "articles": 50, "sample_source_code": 6}
{"how_to": 0, "sdks": 41, "followers": 740, "developers": 47, "api_name": "", "description": " Indeed is a search engine for jobs - with a radically different approach to job search. In one simple search, Indeed gives job seekers free access to millions of employment opportunities from thousands of websites. Indeed.com includes all the job listings from major job boards, newspapers, associations and company career pages - and we continue to add new sites every day. The Indeed API allows developers to integrate Indeed’s employer interface or job seeker interface in apps. The API returns responses in JSON or XML format.", "changelogs": 62, "libraries": 7, "articles": 5, "sample_source_code": 0}
{"how_to": 1, "sdks": 22, "followers": 484, "developers": 44, "api_name": "", "description": " The Calendar Data API lets users perform most of the operations a normal Google Calendar user can on the Google Calendar website. Google Calendar allows client applications to view and update calendar events in the form of Google data API, GData, feeds. The Calendar Data API lets users incorporate Calendar functionality into their own application or website. Users can edit calendars, create and delete events, query for events that match particular criteria, send invitations, and more.\nThere are many possible uses for the Calendar data API. For example, users can create a web front end for a group calendar that uses Google Calendar as a back end. Or a public calendar can be generated for Google Calendar to display, based on a company event database. Or users can search relevant calendars to display a list of upcoming events on those calendars.", "changelogs": 47, "libraries": 9, "articles": 11, "sample_source_code": 11}
{"how_to": 0, "sdks": 0, "followers": 155, "developers": 101, "api_name": "", "description": " From their site: The Google Gadgets API provides a way to put third-party content onto the Google homepage. The main use of the Google Gadgets API is to create gadgets (mini-applications) that users can add to their Google personalized homepages and other Google properties. For example, you could create a photo album gadget, or a gadget that displays an interactive game. The API is designed to be simple enough so that anyone can turn his or her web page or application into a gadget.", "changelogs": 2, "libraries": 0, "articles": 2, "sample_source_code": 3}
{"how_to": 0, "sdks": 0, "followers": 127, "developers": 39, "api_name": "", "description": " The service provides online tools for business organizations to manage travel and expense reporting and reimbursement. Integrated travel booking functions combine with expense reporting within a single platform. The API allows integration with applications of customer companies, partner service providers, or independent third-party developers including mobile app developers.\nAPI methods support submission and tracking of travel requests and booking of transportation and lodging, either for individuals or for groups completing the same travel. Methods also support creating, updating, and submitting expense reports as part of a reimbursement process.", "changelogs": 11, "libraries": 0, "articles": 8, "sample_source_code": 0}
{"how_to": 3, "sdks": 4, "followers": 219, "developers": 59, "api_name": "", "description": " Use the Google Analytics Management API to leverage Google's extensive website analytics tools. The API uses GET requests over HTTPS and JSON for requests/returns. Some of the functions available with the API are: List Account, Property and View (Profile) information for a user; manage properties and goals; manage user permissions; and upload cost data to Google Analytics for non-Google paid campaigns. See the extensive documentation for code samples, detailed method descriptions, and more.", "changelogs": 36, "libraries": 9, "articles": 24, "sample_source_code": 11}
